package realQuestion.美团点评.美团点评2017秋;

/**
 * Created by apple on 2017/8/31.
 * -------------------------------求最大矩形面积------------------------
 * 给定一组非负整数组成的数组h，代表一组柱状图的高度，其中每个柱子的宽度都为1。
 * 在这组柱状图中找到能组成的最大矩形的面积（如图所示）。
 * 入参h为一个整型数组，代表每个柱子的高度，返回面积的值。
 *  输入描述:                                                         输入例子1:
 *  输入包括两行,第一行包含一个整数n(1 ≤ n ≤ 10000)                      6
 *  第二行包括n个整数,表示h数组中的每个值,h_i(1 ≤ h_i ≤ 1,000,000)       2 1 5 6 2 3
 *
 *  输出描述:                                                         输出例子1:
 *  输出一个整数,表示最大的矩阵面积。                                    10
 */
public class Ques3 {
    public static void main(String[] args) {

    }
}
