package realQuestion.美团点评.美团点评2017秋;

/**
 * Created by apple on 2017/8/31.
 * ---------------------------------最长公共连续子串--------------------
 * 给出两个字符串（可能包含空格）,找出其中最长的公共连续子串,输出其长度。
 * 输入描述:                                                输入例子1
 * 输入为两行字符串（可能包含空格），长度均小于等于50.           abcde
 *                                                         abgde
 *
 * 输出描述:                                                输出例子1:
 * 输出为一个整数，表示最长公共连续子串的长度。                  2
 */

public class Ques4 {
    public static void main(String[] args) {

    }
}
