package realQuestion.美团点评.美团点评2018秋内推;

/**
 * Created by apple on 2017/9/1.
 * 题目描述：
     很多网页上会显示一些其它网页的超链接，如一些搜索网页会逐条列出搜索到的条目。
     在一些网页中，被用户点击过的超链接会换一种颜色显示。假设某网页一开始有n条超链接，
     从上到下由1到n编号，每条超链接都显示成一个字符串，最开始所有的超链接用蓝色显示。
     现在给出用户点击过哪些超链接，一条超链接只要被点击过了，就会由蓝色变成紫色，请输出最后所有仍为蓝色的超链接。
     输入
     第一行输入一个数n，接下来n行，每行一个字符串，表示每个超链接的名称。名称只由小写字母构成，长度不超过20，且所有名称互不相同。（1≤n≤100）
     接下来输入一个数m，表示用户点击了m个超链接，最后m行表示用户点击过的超链接名称，这m个链接中可能有重复。（1≤m≤100）

     输出
     输出若干行，每行一个名称，所有仍为蓝色的超链接名称。名称的顺序按照字典序排序。如果全为紫色，直接不输出。
 */

public class Ques2 {

}
